In [21]:
import importlib
import p_plp.db
import p_plp.db.utils
from p_plp.db import *
from p_plp.cohorts import *
importlib.reload(p_plp.db.utils)
dir(p_plp.db.utils)

['CDM_SCHEMA',
 'CdmTable',
 'Enum',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 'fetch_df',
 'get_cdm_table',
 'list_cdm_tables',
 'pd',
 'run_sql',
 'text']

In [22]:
engine = get_engine()
list_observed_conditions(engine).head()

   concept_id             concept_name vocabulary_id  n_occurrences
0     4281516               Gingivitis        SNOMED            264
1      133228            Dental caries        SNOMED            115
2    40481087          Viral sinusitis        SNOMED            108
3     4112343  Acute viral pharyngitis        SNOMED             73
4      260139         Acute bronchitis        SNOMED             66

In [23]:
generate_target_cohort(engine, 133228).head()

   subject_id cohort_start_date cohort_end_date
0         107        1973-01-02      1973-01-02
1           1        1980-06-12      1980-06-12
2         108        1981-10-11      1981-10-11
3          67        1983-04-05      1983-04-05
4         100        1984-10-01      1984-10-01

In [24]:
list_observed_outcomes(engine).head()

   concept_id             concept_name vocabulary_id  n_occurrences
0     4281516               Gingivitis        SNOMED            264
1      133228            Dental caries        SNOMED            115
2    40481087          Viral sinusitis        SNOMED            108
3     4112343  Acute viral pharyngitis        SNOMED             73
4      260139         Acute bronchitis        SNOMED             66

In [25]:
generate_outcome_cohort(engine, 40481087).head()

   subject_id cohort_start_date cohort_end_date
0          63        1989-01-15      1989-01-15
1         117        1989-03-12      1989-03-12
2          86        1990-03-03      1990-03-03
3          66        1997-03-30      1997-03-30
4          82        1999-06-02      1999-06-02

In [26]:
generate_labels_time_at_risk(engine)

,subject_id,index_date,tar_start_date,tar_end_date,outcome_flag,outcome_date
0,107,1973-01-02,1973-01-03,1982-03-21,0,None
1,1,1980-06-12,1980-06-13,1989-08-29,0,2001-06-09
2,108,1981-10-11,1981-10-12,1990-12-28,0,None
3,67,1983-04-05,1983-04-06,1992-06-21,0,None
4,100,1984-10-01,1984-10-02,1993-12-18,0,None
...,...,...,...,...,...,...
65,60,2024-09-12,2024-09-13,2033-11-29,0,None
66,57,2025-03-06,2025-03-07,2034-05-23,0,2024-12-05
67,41,2025-05-23,2025-05-24,2034-08-09,0,None
68,59,2025-06-28,2025-06-29,2034-09-14,0,None
69,71,2025-10-27,2025-10-28,2035-01-13,0,None